In [1]:
import numpy as np

In [2]:
import pandas as pd

# Object creation

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range("20130101", periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [8]:
df

                   A         B         C         D
2013-01-01  0.385587  1.211370 -0.244662 -0.099300
2013-01-02 -0.161344 -1.669679  0.242824 -1.296236
2013-01-03 -0.938432  0.989276 -0.080651 -0.225680
2013-01-04 -0.123938 -1.958377 -1.507825 -1.629814
2013-01-05 -1.198321 -0.376845  1.192051  0.036372
2013-01-06  0.312802 -0.012058  1.451385  0.634741

In [9]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing data

In [12]:
df.head()

                   A         B         C         D
2013-01-01  0.385587  1.211370 -0.244662 -0.099300
2013-01-02 -0.161344 -1.669679  0.242824 -1.296236
2013-01-03 -0.938432  0.989276 -0.080651 -0.225680
2013-01-04 -0.123938 -1.958377 -1.507825 -1.629814
2013-01-05 -1.198321 -0.376845  1.192051  0.036372

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.123938 -1.958377 -1.507825 -1.629814
2013-01-05 -1.198321 -0.376845  1.192051  0.036372
2013-01-06  0.312802 -0.012058  1.451385  0.634741

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.to_numpy()

array([[ 0.38558719,  1.21136977, -0.24466172, -0.0992997 ],
       [-0.16134351, -1.6696788 ,  0.24282406, -1.29623615],
       [-0.93843196,  0.98927607, -0.0806511 , -0.22568029],
       [-0.12393829, -1.95837711, -1.50782491, -1.62981375],
       [-1.19832129, -0.37684541,  1.19205124,  0.03637227],
       [ 0.31280171, -0.01205806,  1.45138504,  0.63474092]])

In [17]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

numpy 所有数据是一个类型，pandas中数据一列是一个类型，转化后不包含index列

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.287274 -0.302719  0.175520 -0.429986
std    0.649520  1.316167  1.071590  0.859326
min   -1.198321 -1.958377 -1.507825 -1.629814
25%   -0.744160 -1.346470 -0.203659 -1.028597
50%   -0.142641 -0.194452  0.081086 -0.162490
75%    0.203617  0.738943  0.954744  0.002454
max    0.385587  1.211370  1.451385  0.634741

In [19]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.385587   -0.161344   -0.938432   -0.123938   -1.198321    0.312802
B    1.211370   -1.669679    0.989276   -1.958377   -0.376845   -0.012058
C   -0.244662    0.242824   -0.080651   -1.507825    1.192051    1.451385
D   -0.099300   -1.296236   -0.225680   -1.629814    0.036372    0.634741

In [20]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.099300 -0.244662  1.211370  0.385587
2013-01-02 -1.296236  0.242824 -1.669679 -0.161344
2013-01-03 -0.225680 -0.080651  0.989276 -0.938432
2013-01-04 -1.629814 -1.507825 -1.958377 -0.123938
2013-01-05  0.036372  1.192051 -0.376845 -1.198321
2013-01-06  0.634741  1.451385 -0.012058  0.312802

In [21]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-04 -0.123938 -1.958377 -1.507825 -1.629814
2013-01-02 -0.161344 -1.669679  0.242824 -1.296236
2013-01-05 -1.198321 -0.376845  1.192051  0.036372
2013-01-06  0.312802 -0.012058  1.451385  0.634741
2013-01-03 -0.938432  0.989276 -0.080651 -0.225680
2013-01-01  0.385587  1.211370 -0.244662 -0.099300

# Selection

## Getting

In [22]:
df["A"]

2013-01-01    0.385587
2013-01-02   -0.161344
2013-01-03   -0.938432
2013-01-04   -0.123938
2013-01-05   -1.198321
2013-01-06    0.312802
Freq: D, Name: A, dtype: float64

In [23]:
df.A

2013-01-01    0.385587
2013-01-02   -0.161344
2013-01-03   -0.938432
2013-01-04   -0.123938
2013-01-05   -1.198321
2013-01-06    0.312802
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2013-01-01  0.385587  1.211370 -0.244662 -0.099300
2013-01-02 -0.161344 -1.669679  0.242824 -1.296236
2013-01-03 -0.938432  0.989276 -0.080651 -0.225680

In [25]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.161344 -1.669679  0.242824 -1.296236
2013-01-03 -0.938432  0.989276 -0.080651 -0.225680
2013-01-04 -0.123938 -1.958377 -1.507825 -1.629814

## Selection by label

In [26]:
df.loc[dates[0]]

A    0.385587
B    1.211370
C   -0.244662
D   -0.099300
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.385587  1.211370
2013-01-02 -0.161344 -1.669679
2013-01-03 -0.938432  0.989276
2013-01-04 -0.123938 -1.958377
2013-01-05 -1.198321 -0.376845
2013-01-06  0.312802 -0.012058

In [28]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.161344 -1.669679
2013-01-03 -0.938432  0.989276
2013-01-04 -0.123938 -1.958377

In [29]:
df.loc["20130102", ["A", "B"]]

A   -0.161344
B   -1.669679
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
df.loc[dates[0], "A"]

0.3855871881241962

In [31]:
df.at[dates[0], "A"]

0.3855871881241962

## Selection by position

In [32]:
df.iloc[3]

A   -0.123938
B   -1.958377
C   -1.507825
D   -1.629814
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.123938 -1.958377
2013-01-05 -1.198321 -0.376845

In [34]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.161344  0.242824
2013-01-03 -0.938432 -0.080651
2013-01-05 -1.198321  1.192051

In [35]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.161344 -1.669679  0.242824 -1.296236
2013-01-03 -0.938432  0.989276 -0.080651 -0.225680

In [36]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.211370 -0.244662
2013-01-02 -1.669679  0.242824
2013-01-03  0.989276 -0.080651
2013-01-04 -1.958377 -1.507825
2013-01-05 -0.376845  1.192051
2013-01-06 -0.012058  1.451385

In [37]:
df.iloc[1, 1]

-1.6696787965853606

In [38]:
df.iat[1, 1]

-1.6696787965853606

## Boolean indexing

In [39]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.385587  1.211370 -0.244662 -0.099300
2013-01-06  0.312802 -0.012058  1.451385  0.634741

In [40]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.385587  1.211370       NaN       NaN
2013-01-02       NaN       NaN  0.242824       NaN
2013-01-03       NaN  0.989276       NaN       NaN
2013-01-04       NaN       NaN       NaN       NaN
2013-01-05       NaN       NaN  1.192051  0.036372
2013-01-06  0.312802       NaN  1.451385  0.634741

In [41]:
df2 = df.copy()

In [42]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [43]:
df2

                   A         B         C         D      E
2013-01-01  0.385587  1.211370 -0.244662 -0.099300    one
2013-01-02 -0.161344 -1.669679  0.242824 -1.296236    one
2013-01-03 -0.938432  0.989276 -0.080651 -0.225680    two
2013-01-04 -0.123938 -1.958377 -1.507825 -1.629814  three
2013-01-05 -1.198321 -0.376845  1.192051  0.036372   four
2013-01-06  0.312802 -0.012058  1.451385  0.634741  three

In [44]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -0.938432  0.989276 -0.080651 -0.225680   two
2013-01-05 -1.198321 -0.376845  1.192051  0.036372  four

## Setting

In [45]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [46]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [47]:
df["F"] = s1

In [48]:
df.at[dates[0], "A"] = 0

In [49]:
df.iat[0, 1] = 0

In [50]:
df.loc[:, "D"] = np.array([5] * len(df))

In [51]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.244662  5  NaN
2013-01-02 -0.161344 -1.669679  0.242824  5  1.0
2013-01-03 -0.938432  0.989276 -0.080651  5  2.0
2013-01-04 -0.123938 -1.958377 -1.507825  5  3.0
2013-01-05 -1.198321 -0.376845  1.192051  5  4.0
2013-01-06  0.312802 -0.012058  1.451385  5  5.0

In [52]:
df2 = df.copy()

In [53]:
df2[df2 > 0] = -df2

In [54]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.244662 -5  NaN
2013-01-02 -0.161344 -1.669679 -0.242824 -5 -1.0
2013-01-03 -0.938432 -0.989276 -0.080651 -5 -2.0
2013-01-04 -0.123938 -1.958377 -1.507825 -5 -3.0
2013-01-05 -1.198321 -0.376845 -1.192051 -5 -4.0
2013-01-06 -0.312802 -0.012058 -1.451385 -5 -5.0

# Missing data

In [55]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data:

In [56]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [57]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.244662  5  NaN  1.0
2013-01-02 -0.161344 -1.669679  0.242824  5  1.0  1.0
2013-01-03 -0.938432  0.989276 -0.080651  5  2.0  NaN
2013-01-04 -0.123938 -1.958377 -1.507825  5  3.0  NaN

In [58]:
df1.dropna(how="any")

                   A         B         C  D    F    E
2013-01-02 -0.161344 -1.669679  0.242824  5  1.0  1.0

In [59]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.244662  5  5.0  1.0
2013-01-02 -0.161344 -1.669679  0.242824  5  1.0  1.0
2013-01-03 -0.938432  0.989276 -0.080651  5  2.0  5.0
2013-01-04 -0.123938 -1.958377 -1.507825  5  3.0  5.0

In [60]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operation

## Stats

In [61]:
df.mean()

A   -0.351539
B   -0.504614
C    0.175520
D    5.000000
F    3.000000
dtype: float64

In [62]:
df.mean(1)

2013-01-01    1.188835
2013-01-02    0.882360
2013-01-03    1.394039
2013-01-04    0.881972
2013-01-05    1.723377
2013-01-06    2.350426
Freq: D, dtype: float64

In [63]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)  # 向下移动两位，空出来的填充NaN

In [64]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [65]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.938432 -0.010724 -1.080651  4.0  1.0
2013-01-04 -3.123938 -4.958377 -4.507825  2.0  0.0
2013-01-05 -6.198321 -5.376845 -3.807949  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

## Apply

In [66]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.244662   5   NaN
2013-01-02 -0.161344 -1.669679 -0.001838  10   1.0
2013-01-03 -1.099775 -0.680403 -0.082489  15   3.0
2013-01-04 -1.223714 -2.638780 -1.590314  20   6.0
2013-01-05 -2.422035 -3.015625 -0.398262  25  10.0
2013-01-06 -2.109233 -3.027683  1.053123  30  15.0

In [67]:
df.apply(lambda x: x.max() - x.min())

A    1.511123
B    2.947653
C    2.959210
D    0.000000
F    4.000000
dtype: float64

## Histogramming

In [68]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [69]:
s

0    6
1    6
2    4
3    5
4    6
5    2
6    0
7    6
8    5
9    3
dtype: int64

In [70]:
s.value_counts()

6    4
5    2
4    1
2    1
0    1
3    1
dtype: int64

## String Methods

In [71]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [72]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge

## Concat

In [73]:
df = pd.DataFrame(np.random.randn(10, 4))

In [74]:
df

          0         1         2         3
0  0.026119  0.620464 -1.681873  0.411063
1  0.093662 -0.099581  0.241964  1.016028
2 -1.494664 -1.900583 -1.333559  0.412032
3 -0.041106  0.464444  1.793701  0.632875
4 -2.215814 -0.518519  0.410587 -0.602130
5  1.334033  0.157163 -0.043629  1.130194
6 -0.365015  0.550045 -0.892490 -1.141258
7 -0.682737 -0.339471 -0.110135 -0.598434
8  0.982924 -1.156564 -1.888744 -0.118284
9 -1.376544 -1.157442  0.099566  1.046660

In [75]:
pieces = [df[:3], df[3:7], df[7:]]

In [76]:
pieces

[          0         1         2         3
 0  0.026119  0.620464 -1.681873  0.411063
 1  0.093662 -0.099581  0.241964  1.016028
 2 -1.494664 -1.900583 -1.333559  0.412032,
           0         1         2         3
 3 -0.041106  0.464444  1.793701  0.632875
 4 -2.215814 -0.518519  0.410587 -0.602130
 5  1.334033  0.157163 -0.043629  1.130194
 6 -0.365015  0.550045 -0.892490 -1.141258,
           0         1         2         3
 7 -0.682737 -0.339471 -0.110135 -0.598434
 8  0.982924 -1.156564 -1.888744 -0.118284
 9 -1.376544 -1.157442  0.099566  1.046660]

In [77]:
pd.concat(pieces)

          0         1         2         3
0  0.026119  0.620464 -1.681873  0.411063
1  0.093662 -0.099581  0.241964  1.016028
2 -1.494664 -1.900583 -1.333559  0.412032
3 -0.041106  0.464444  1.793701  0.632875
4 -2.215814 -0.518519  0.410587 -0.602130
5  1.334033  0.157163 -0.043629  1.130194
6 -0.365015  0.550045 -0.892490 -1.141258
7 -0.682737 -0.339471 -0.110135 -0.598434
8  0.982924 -1.156564 -1.888744 -0.118284
9 -1.376544 -1.157442  0.099566  1.046660

## Join

In [78]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

In [79]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [80]:
left

   key  lval
0  foo     1
1  foo     2

In [81]:
right

   key  rval
0  foo     4
1  foo     5

In [82]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [83]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})

In [84]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

In [85]:
left

   key  lval
0  foo     1
1  bar     2

In [86]:
right

   key  rval
0  foo     4
1  bar     5

In [87]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

# Grouping

Splitting the data into groups based on some criteria

Applying a function to each group independently

Combining the results into a data structure

In [88]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [89]:
df

     A      B         C         D
0  foo    one  0.110795 -0.160586
1  bar    one -1.636003  0.844856
2  foo    two  1.161237  0.071066
3  bar  three -0.455513 -0.941874
4  foo    two  0.846078 -0.298174
5  bar    two  2.348798 -1.107463
6  foo    one -2.183013  0.327458
7  foo  three  1.121172  0.217944

In [90]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  0.257281 -1.204481
foo  1.056270  0.157708

In [91]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one   -1.636003  0.844856
    three -0.455513 -0.941874
    two    2.348798 -1.107463
foo one   -2.072218  0.166872
    three  1.121172  0.217944
    two    2.007315 -0.227108

# Reshaping

## Stack

In [92]:
tuples = list(
    zip(
        ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
        ["one", "two", "one", "two", "one", "two", "one", "two"],
    )
)

In [93]:
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

In [94]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [95]:
df2 = df[:4]

In [96]:
df2

                     A         B
first second
bar   one     0.302754  0.013473
      two     0.501432  0.218997
baz   one     0.324022  1.166080
      two     1.351262  1.037250

In [97]:
stacked = df2.stack()

In [98]:
stacked

first  second
bar    one     A    0.302754
               B    0.013473
       two     A    0.501432
               B    0.218997
baz    one     A    0.324022
               B    1.166080
       two     A    1.351262
               B    1.037250
dtype: float64

In [99]:
stacked.unstack()

                     A         B
first second
bar   one     0.302754  0.013473
      two     0.501432  0.218997
baz   one     0.324022  1.166080
      two     1.351262  1.037250

by default unstacks the last level:

In [100]:
stacked.unstack(1)

second        one       two
first
bar   A  0.302754  0.501432
      B  0.013473  0.218997
baz   A  0.324022  1.351262
      B  1.166080  1.037250

In [101]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.302754  0.324022
       B  0.013473  1.166080
two    A  0.501432  1.351262
       B  0.218997  1.037250

## Pivot tables

In [102]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [103]:
df

        A  B    C         D         E
0     one  A  foo -0.290062 -0.960917
1     one  B  foo -0.066547  1.757999
2     two  C  foo -0.388035  0.258028
3   three  A  bar  0.312231  0.438433
4     one  B  bar  1.202951  0.916570
5     one  C  bar  0.176667 -0.068951
6     two  A  foo -0.547326 -0.205874
7   three  B  foo  1.065180 -0.855732
8     one  C  foo -0.446599  0.667837
9     one  A  bar  0.471315  0.751817
10    two  B  bar -0.769312  1.586043
11  three  C  bar  0.922553  0.425705

In [104]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A  0.471315 -0.290062
      B  1.202951 -0.066547
      C  0.176667 -0.446599
three A  0.312231       NaN
      B       NaN  1.065180
      C  0.922553       NaN
two   A       NaN -0.547326
      B -0.769312       NaN
      C       NaN -0.388035

# Time series

In [105]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")

In [106]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [107]:
ts

2012-01-01 00:00:00    201
2012-01-01 00:00:01    420
2012-01-01 00:00:02    345
2012-01-01 00:00:03    498
2012-01-01 00:00:04    211
                      ...
2012-01-01 00:01:35    348
2012-01-01 00:01:36     18
2012-01-01 00:01:37     15
2012-01-01 00:01:38    326
2012-01-01 00:01:39    361
Freq: S, Length: 100, dtype: int64

In [108]:
ts.resample("5Min").sum()

2012-01-01    24112
Freq: 5T, dtype: int64

In [109]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")

In [110]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [111]:
ts

2012-03-06   -0.346614
2012-03-07    0.301014
2012-03-08    0.596352
2012-03-09   -0.240591
2012-03-10    0.787674
Freq: D, dtype: float64

In [112]:
ts_utc = ts.tz_localize("UTC")

In [113]:
ts_utc

2012-03-06 00:00:00+00:00   -0.346614
2012-03-07 00:00:00+00:00    0.301014
2012-03-08 00:00:00+00:00    0.596352
2012-03-09 00:00:00+00:00   -0.240591
2012-03-10 00:00:00+00:00    0.787674
Freq: D, dtype: float64

In [114]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00   -0.346614
2012-03-06 19:00:00-05:00    0.301014
2012-03-07 19:00:00-05:00    0.596352
2012-03-08 19:00:00-05:00   -0.240591
2012-03-09 19:00:00-05:00    0.787674
Freq: D, dtype: float64

In [115]:
rng = pd.date_range("1/1/2012", periods=5, freq="M")

In [116]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [117]:
ts

2012-01-31    0.123582
2012-02-29   -1.862146
2012-03-31    0.849074
2012-04-30   -0.083227
2012-05-31   -0.227173
Freq: M, dtype: float64

In [118]:
ps = ts.to_period()

In [119]:
ps

2012-01    0.123582
2012-02   -1.862146
2012-03    0.849074
2012-04   -0.083227
2012-05   -0.227173
Freq: M, dtype: float64

In [120]:
ps.to_timestamp()

2012-01-01    0.123582
2012-02-01   -1.862146
2012-03-01    0.849074
2012-04-01   -0.083227
2012-05-01   -0.227173
Freq: MS, dtype: float64

In [121]:
prng = pd.period_range("1990Q1", "2000Q4", freq="Q-NOV")

In [122]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [123]:
ts.index = (prng.asfreq("M", "e") + 1).asfreq("H", "s") + 9

In [124]:
ts.head()

1990-03-01 09:00    0.523438
1990-06-01 09:00   -0.236863
1990-09-01 09:00    1.077191
1990-12-01 09:00   -1.288842
1991-03-01 09:00   -1.116638
Freq: H, dtype: float64

# Categoricals

In [125]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)

In [126]:
df["grade"] = df["raw_grade"].astype("category")

In [127]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [128]:
new_categories = ["very good", "good", "very bad"]

In [129]:
df["grade"] = df["grade"].cat.rename_categories(new_categories)

In [130]:
df["grade"] = df["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]
)

In [131]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [132]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [133]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64